Tekla Open API Reference for Tekla Structures 2025
Part.CastUnitTypeEnum Enumeration
 The cast unit types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CastUnitTypeEnum
Public Enumeration CastUnitTypeEnum
Members
Member name | Value | Description
PRECAST | 0 |  The precast cast unit type.
CAST_IN_PLACE | 1 |  The cast in place cast unit type.
See Also
Reference
Tekla.Structures.Model Namespace